zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_pcd.c
  * @author  MCD Application Team
  * @brief   PCD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                    ##### How to use this driver #####
  ==============================================================================
    [..]
      The PCD HAL driver can be used as follows:

     (#) Declare a PCD_HandleTypeDef handle structure, for example:
         PCD_HandleTypeDef  hpcd;

     (#) Fill parameters of Init structure in HCD handle

     (#) Call HAL_PCD_Init() API to initialize the PCD peripheral (Core, Device core, ...)

     (#) Initialize the PCD low level resources through the HAL_PCD_MspInit() API:
         (##) Enable the PCD/USB Low Level interface clock
         (##) Initialize the related GPIO clocks
         (##) Configure PCD pin-out
         (##) Configure PCD NVIC interrupt

     (#)Associate the Upper USB device stack to the HAL PCD Driver:
         (##) hpcd.pData = pdev;

     (#)Enable PCD transmission and reception:
         (##) HAL_PCD_Start();

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "stm32mp2xx_hal.h"

#define PCD_DBGLOG(...) (void)printf("PCD_DEBUG : " __VA_ARGS__);
#if (PCD_DEBUG_LEVEL > 0)
#define PCD_DBGLOG1(...)  (void)printf("PCD_DEBUG : " __VA_ARGS__);
#else
#define PCD_DBGLOG1(...)
#endif /*PCD_DEBUG_LEVEL 1*/
#if (PCD_DEBUG_LEVEL > 1)
#define PCD_DBGLOG2(...)  (void)printf("PCD_DEBUG : " __VA_ARGS__);
#else
#define PCD_DBGLOG2(...)
#endif /*PCD_DEBUG_LEVEL 2*/
#if (PCD_DEBUG_LEVEL > 2)
#define PCD_DBGLOG3(...)  (void)printf("PCD_DEBUG : " __VA_ARGS__);
#else
#define PCD_DBGLOG3(...)
#endif /*PCD_DEBUG_LEVEL 3*/

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup PCD PCD
  * @brief PCD HAL module driver
  * @{
  */

#ifdef HAL_PCD_MODULE_ENABLED

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
#define PCD_DEV_EVENTS_INTR 0 /* Interrupt to use for device events */

/** @defgroup PCD_Private_Macros PCD Private Macros
  * @{
  */
#define IS_MULTIPLE(x, a)   (((x) % (a)) == 0U)
#define ALIGN_MULTIPLE(x, a)  ((a) * (((x) / (a)) + ((((x) % (a)) != 0U) ? 1U : 0U)))

#define IS_ALIGNED(x, a)    (((x) & ((typeof(x))(a) - 1)) == 0)

/**
  * @}
  */

/* Private functions prototypes ----------------------------------------------*/
/** @defgroup PCD_Private_Functions PCD Private Functions
  * @{
  */

static PCD_DmaAddrDef PCD_MapDmaAddr(const uint8_t buf[], uint32_t size, uint8_t to_device)
{
  UNUSED(size);
  UNUSED(to_device);
  return (PCD_DmaAddrDef)buf;
}

static void PCD_UnMapDmaAddr(PCD_DmaAddrDef dma_addr, uint32_t size, uint8_t to_device)
{
  UNUSED(dma_addr);
  UNUSED(size);
  UNUSED(to_device);
  return;
}

static PCD_DmaAddrDef PCD_GetDmaAddr(const uint8_t buf[], uint32_t size, uint8_t to_device)
{
  UNUSED(size);
  UNUSED(to_device);
  return (PCD_DmaAddrDef)buf;
}

static void PCD_PutDmaAddr(PCD_DmaAddrDef dma_addr, uint32_t size, uint8_t to_device)
{
  UNUSED(dma_addr);
  UNUSED(size);
  UNUSED(to_device);
  return;
}

static void *PCD_MapCoherentAddr(void *addr, uint32_t size)
{
  UNUSED(addr);
  UNUSED(size);
  return addr;
}

static void PCD_UnMapCoherentAddr(const void *addr)
{
  UNUSED(addr);
  return;
}

static void *PCD_MapIOAddr(uint32_t addr, uint32_t size)
{
  UNUSED(addr);
  UNUSED(size);
  return (uint32_t *)addr;
}

static void PCD_UnMapIOAddr(const void *addr)
{
  UNUSED(addr);
  return;
}

static int32_t PCD_IRQRegister(void (*irq_handler)(PCD_HandleTypeDef *hpcd), const PCD_HandleTypeDef *hpcd)
{
  UNUSED(irq_handler);
  UNUSED(hpcd);
  return (int32_t)HAL_OK;
}

static void PCD_IRQUnRegister(const PCD_HandleTypeDef *hpcd)
{
  UNUSED(hpcd);
  return;
}

static void PCD_Memcpy(void *dest, const void *src, uint32_t num)
{
#ifdef AVOID_COMPILER_MEMCPY
  uint8_t *pcDst = (uint8_t *) dest;
  uint8_t const *pcSrc = (uint8_t const *) src;

  while (num--)
  {
    *pcDst++ = *pcSrc++;
  }
#else
  (void)memcpy(dest, src, num);
#endif /*AVOID_COMPILER_MEMCPY*/

  return;
}

static void PCD_Handle_EP_Event(PCD_HandleTypeDef *hpcd, uint32_t event)
{
  uint8_t type = USB_ReadEndpointEventType(event);
  uint8_t phy_epnum = USB_ReadEndpointEventEpNum(event);
  uint8_t status = USB_ReadEndpointEventStatus(event);
  uint8_t ep_addr;
  uint8_t ep_num;
  USB_DWC3_EPTypeDef *ep;
  HAL_StatusTypeDef ret;

  ep_addr = __HAL_PCD_PHYEPNUM_TO_EPADDR(phy_epnum);
  ep_num = ep_addr & 0x7FU;

  if ((ep_addr & 0x80U) == 0x80U)
  {
    ep = &hpcd->IN_ep[ep_num];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_num];
  }

  switch (type)
  {
    case USB_DWC3_DEPEVT_XFERCOMPLETE:
      PCD_DBGLOG3("EP%d%s: Transfer Complete Event=%lx\n", ep_num, ep->is_in ? "IN" : "OUT", event);

      if (ep->type == EP_TYPE_ISOC)
      {
        PCD_DBGLOG1("EP%d%s is an Isochronous endpoint\n", ep_num, ep->is_in ? "IN" : "OUT");
        break;
      }

      /* Just for Log, since ctrl expects sw to follow the whole control
      programming sequence, as also mentioned in Linux driver */
      if ((USB_GetTRBStatusEP(ep) == USB_DWC3_TRBSTS_SETUP_PENDING) && (ep_num == 0U))
      {
        PCD_DBGLOG3("EP%d%s Setup Pending received\n", ep_num, ep->is_in ? "IN" : "OUT");
      }

      PCD_DBGLOG2("EP%d%s: Transfer Complete trb %08lx:%08lx:%08lx:%08lx:%08lx TRB-Status %d\n", ep_num,
                  ep->is_in ? "IN" : "OUT",
                  (uint32_t)ep->trb_addr, (uint32_t)ep->trb_addr->bph,
                  (uint32_t)ep->trb_addr->bpl, (uint32_t)ep->trb_addr->size,
                  (uint32_t)ep->trb_addr->ctrl, USB_GetTRBStatusEP(ep));

      if ((ep_addr & 0x80U) == 0x80U)   /* IN EP */
      {
        ep->xfer_count = ep->xfer_len - USB_GetTRBLengthEP(ep);

        ep->flags &= ~USB_DWC3_EP_REQ_QUEUED;

        if (ep->xfer_buff != 0U)
        {
          PCD_UnMapDmaAddr(ep->dma_addr, ep->xfer_len, 1);
        }

        /* For EP0IN, if packet is not sent completely, then error, as done in Linux driver */
        if ((ep_num == 0U) && (ep->xfer_len != ep->xfer_count))
        {
          ret = HAL_PCD_EP_SetStall(hpcd, ep_num); /*OUT EP0*/
          if (ret != HAL_OK)
          {
            PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
          }
        }

        /* if 3-stage then wait for XFERNOTREADY(control-status) before sending data to upper layer*/
        if ((ep_num != 0U) || (ep->xfer_len == 0U))
        {
          HAL_PCD_DataInStageCallback(hpcd, ep_num);
        }

