zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
        /* For EP0, this is ZLP, so prepare EP0 for next setup */
        if ((ep_num == 0U) && (ep->xfer_len == 0U))
        {
          /* prepare to rx more setup packets */
          hpcd->EP0_State = HAL_PCD_EP0_SETUP_QUEUED;

          ret = USB_EP0_OutStart(hpcd->Instance, &hpcd->OUT_ep[0], hpcd->Setup_dma_addr);
          if (ret != HAL_OK)
          {
            PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
            return;
          }
        }
      }
      else
      {
        ep->xfer_count = ep->xfer_len - USB_GetTRBLengthEP(ep);

        ep->flags &= ~USB_DWC3_EP_REQ_QUEUED;

        /* For EP0OUT */
        if ((ep_addr == 0U) && (hpcd->EP0_State == HAL_PCD_EP0_SETUP_QUEUED))
        {

          hpcd->EP0_State = HAL_PCD_EP0_SETUP_COMPLETED;
          ep->is_stall = false;
          PCD_DBGLOG2("EP%d%s: SetupData %02x%02x%02x%02x:%02x%02x%02x%02x\n", ep_num, ep->is_in ? "IN" : "OUT",
                      hpcd->Setup_addr[0], hpcd->Setup_addr[1], hpcd->Setup_addr[2], hpcd->Setup_addr[3],
                      hpcd->Setup_addr[4], hpcd->Setup_addr[5], hpcd->Setup_addr[6], hpcd->Setup_addr[7]);

          /* if 2-stage then wait for the XFERNOTREADY(control-status) */
          if (__HAL_PCD_SETUP_REQ_LEN(hpcd->Setup_addr) != 0U)
          {
            HAL_PCD_SetupStageCallback(hpcd);
          }
        }
        else
        {

          if (ep->xfer_buff != 0U)
          {
            PCD_UnMapDmaAddr(ep->dma_addr, ep->xfer_len, 0);
          }

          if (ep->xfer_buff == ep->bounce_buf)
          {
            PCD_Memcpy(ep->xfer_dest_buff, ep->xfer_buff, ep->xfer_count);
          }

          /* if 3-stage then wait for XFERNOTREADY(control-status) before sending data to upper layer */
          if ((ep_num != 0U) || (ep->xfer_len == 0U))
          {
            HAL_PCD_DataOutStageCallback(hpcd, ep_num);
          }

          /* For EP0, this is ZLP, so prepare EP0 for next setup */
          if ((ep_num == 0U) && (ep->xfer_len == 0U))
          {
            /* prepare to rx more setup packets */
            hpcd->EP0_State = HAL_PCD_EP0_SETUP_QUEUED;

            ret = USB_EP0_OutStart(hpcd->Instance, &hpcd->OUT_ep[0], hpcd->Setup_dma_addr);
            if (ret != HAL_OK)
            {
              PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
              return;
            }
          }
        }
      }

      break;

    case USB_DWC3_DEPEVT_XFERINPROGRESS:
      PCD_DBGLOG1("EP%d%s: Transfer In-Progress %ld Event=%lx\n", ep_num, ep->is_in ? "IN" : "OUT",
                  hpcd->IntBuffers.EvtBufferPos[0], event);

      if (ep_num == 0U)
      {
        break;
      }

      if (ep->type != EP_TYPE_ISOC)
      {
        break;
      }

      PCD_DBGLOG2("EP%d%s: Transfer Complete trb %08lx:%08lx:%08lx:%08lx:%08lx TRB-Status %d\n", ep_num,
                  ep->is_in ? "IN" : "OUT",
                  (uint32_t)ep->trb_addr, (uint32_t)ep->trb_addr->bph,
                  (uint32_t)ep->trb_addr->bpl, (uint32_t)ep->trb_addr->size,
                  (uint32_t)ep->trb_addr->ctrl, USB_GetTRBStatusEP(ep));

      if (USB_GetTRBStatusEP(ep) == USB_DWC3_TRBSTS_MISSED_ISOC)
      {
        PCD_DBGLOG("EP%d%s Missed Isoc Interval received\n", ep_num, ep->is_in ? "IN" : "OUT");
        (void)USB_EPStopXfer(hpcd->Instance, ep);
      }
      if ((ep_addr & 0x80U) == 0x80U)   /* IN EP */
      {
        /* length valid only if TRB-Status is normal */
        if (USB_GetTRBStatusEP(ep) != USB_DWC3_TRBSTS_MISSED_ISOC)
        {
          ep->xfer_count = ep->xfer_len - USB_GetTRBLengthEP(ep);
        }

        ep->flags &= ~USB_DWC3_EP_REQ_QUEUED;

        if (ep->xfer_buff != 0)
        {
          PCD_UnMapDmaAddr(ep->dma_addr, ep->xfer_len, 1);
        }

        HAL_PCD_DataInStageCallback(hpcd, ep_num);
      }
      else
      {
        /*length valid only if TRB-Status is normal*/
        if (USB_GetTRBStatusEP(ep) != USB_DWC3_TRBSTS_MISSED_ISOC)
        {
          ep->xfer_count = ep->xfer_len - USB_GetTRBLengthEP(ep);
        }

        ep->flags &= ~USB_DWC3_EP_REQ_QUEUED;

        if (ep->xfer_buff != 0)
        {
          PCD_UnMapDmaAddr(ep->dma_addr, ep->xfer_len, 0);
        }

        if (ep->xfer_buff == ep->bounce_buf)
        {
          PCD_Memcpy(ep->xfer_dest_buff, ep->xfer_buff, ep->xfer_count);
        }

        HAL_PCD_DataOutStageCallback(hpcd, ep_num);
      }

      break;

    case USB_DWC3_DEPEVT_XFERNOTREADY:
      PCD_DBGLOG3("EP%d%s: Transfer Not Ready Event=%lx\n", ep_num, ep->is_in ? "IN" : "OUT", event);
      /* For EP0IN or EP0OUT, xfernotready interrupt not used */

      if (ep_num == 0U)
      {
        if (hpcd->EP0_State == HAL_PCD_EP0_SETUP_QUEUED)
        {
          ret = HAL_PCD_EP_SetStall(hpcd, ep_num);  /*OUT EP0*/
          if (ret != HAL_OK)
          {
            PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
            return;
          }
        }
        else
        {
          if (__HAL_PCD_SETUP_REQ_LEN(hpcd->Setup_addr) == 0U)
          {
            switch (status)
            {
              case USB_DWC3_DEPEVT_XFERNOTREADY_STATUS_CTRL_STATUS:
                HAL_PCD_SetupStageCallback(hpcd);
                break;
              case USB_DWC3_DEPEVT_XFERNOTREADY_STATUS_CTRL_DATA:
                ret = HAL_PCD_EP_SetStall(hpcd, ep_num); /*OUT EP0*/
                if (ret != HAL_OK)
                {
                  PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                }
                break;
              default:
                PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                break;
            }
          }
          else
          {
            switch (status)
            {
              case USB_DWC3_DEPEVT_XFERNOTREADY_STATUS_CTRL_STATUS:
                if ((ep_addr & 0x80U) == 0x80U)
                {
                  HAL_PCD_DataOutStageCallback(hpcd, ep_num);
                }
                else
                {
                  HAL_PCD_DataInStageCallback(hpcd, ep_num);
                }
                break;
              case USB_DWC3_DEPEVT_XFERNOTREADY_STATUS_CTRL_DATA:
                if ((ep_addr & 0x80U) == 0x80U)
                {
                  /* if wrong direction */
                  if (__HAL_PCD_SETUP_REQ_DATA_DIR_IN(hpcd->Setup_addr) == 0U)
                  {
                    ret = USB_EPStopXfer(hpcd->Instance, &hpcd->OUT_ep[0]);
                    if (ret != HAL_OK)
                    {
                      PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                    }
                    ret = HAL_PCD_EP_SetStall(hpcd, ep_num); /*OUT EP0*/
                    if (ret != HAL_OK)
                    {
                      PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                    }
                  }
                  /* last packet is MPS multiple, so send ZLP packet, handled by USBD_core.c */
                }
                else
                {
                  /* if wrong direction */
                  if (__HAL_PCD_SETUP_REQ_DATA_DIR_IN(hpcd->Setup_addr) != 0U)
                  {
                    ret = USB_EPStopXfer(hpcd->Instance, &hpcd->IN_ep[0]);
                    if (ret != HAL_OK)
                    {
                      PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                    }
                    ret = HAL_PCD_EP_SetStall(hpcd, ep_num); /*OUT EP0*/
                    if (ret != HAL_OK)
                    {
                      PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                    }
                  }
                }
                break;
              default:
                PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
                break;
            }
          }
        }
      }

      /* HAL doesn't provide request queue to support On-demand transfers for non-isoc EP,
      it only supports preset transfers so this event will not be used, Section 9.2.4
      "Transfer Setup Recommendations" */

