zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
      /* But for isoc transfers we need to issue the request from here using the micro-frame number */
      if (ep->type != EP_TYPE_ISOC)
      {
        break;
      }

      /* if pending isoc transfer then issue it now using the uframe number */
      ep->uframe = USB_ReadEndpointEventParam(event) & ~((1U << (ep->bInterval - 1U)) - 1U);
      PCD_DBGLOG1("EP%d%s: ISOC Transfer Not Ready %lx\n", ep_num, ep->is_in ? "IN" : "OUT", (uint32_t)ep->uframe);

      if ((ep->flags & USB_DWC3_EP_ISOC_START_PENDING) != 0U)
      {
        ret = USB_EPStartXfer(hpcd->Instance, ep);
        if (ret != HAL_OK)
        {
          PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
          return;
        }
      }
      break;

    case USB_DWC3_DEPEVT_STREAMEVT: /* Stream event, Not used */
      break;
    case USB_DWC3_DEPEVT_RXTXFIFOEVT: /* FIFO Overrun */
      break;
    case USB_DWC3_DEPEVT_EPCMDCMPLT: /* Endpoint Command Complete */
      PCD_DBGLOG1("EP%d%s: Endpoint Command Complete Event=%lx\n", ep_num, ep->is_in ? "IN" : "OUT", event);
      break;
    default:
      break;
  }
}

static void PCD_Handle_DEV_Event(PCD_HandleTypeDef *hpcd, uint32_t event)
{
  uint8_t type = USB_ReadDeviceEventType(event);
  uint8_t i;
  USB_DWC3_EPTypeDef *ep;
  HAL_StatusTypeDef ret;

  switch (type)
  {
    case USB_DWC3_DEVICE_EVENT_DISCONNECT:
      PCD_DBGLOG1("Event: Device Disconnect\n");
      /* For SuperSpeed, set DCTL[8:5] to 5*/

      HAL_PCD_DisconnectCallback(hpcd);
      break;

    case USB_DWC3_DEVICE_EVENT_RESET:
      PCD_DBGLOG1("Event: Device Reset\n");

      if (hpcd->EP0_State != HAL_PCD_EP0_SETUP_QUEUED)
      {
        ret = USB_EPStopXfer(hpcd->Instance, &hpcd->OUT_ep[0]);
        if (ret != HAL_OK)
        {
          PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
        }
        ret = HAL_PCD_EP_SetStall(hpcd, 0); /*OUT EP0*/
        if (ret != HAL_OK)
        {
          PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
        }
      }

      /* Stop transfers for all(USB_DWC3_NUM_IN_EPS) EP except EP0IN k = USB_DWC3_NUM_IN_EP */
      for (i = 0; i < USB_DWC3_NUM_IN_EP; i++)
      {
        if (USB_EPStopXfer(hpcd->Instance, &hpcd->IN_ep[i]) == HAL_OK)
        {
          /* Nothing to Do*/
        }
      }

      /* Stop transfers for all EP except EP0OUT k = USB_DWC3_NUM_OUT_EP */
      for (i = 1; i < USB_DWC3_NUM_OUT_EP; i++)
      {
        if (USB_EPStopXfer(hpcd->Instance, &hpcd->OUT_ep[i]) == HAL_OK)
        {
          /* Nothing to Do*/
        }
      }

      /* Clear Stall for all EP except EP0IN k = USB_DWC3_NUM_IN_EP */
      for (i = 1; i < USB_DWC3_NUM_IN_EP; i++)
      {
        ep = &hpcd->IN_ep[i];

        if (!ep->is_stall)
        {
          continue;
        }

        ep->is_stall = false;

        ret = USB_EPClearStall(hpcd->Instance, ep);
        if (ret != HAL_OK)
        {
          PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
          return;
        }
      }

      /* Clear Stall for all EP except EP0OUT k = USB_DWC3_NUM_OUT_EP */
      for (i = 1; i < USB_DWC3_NUM_OUT_EP; i++)
      {
        ep = &hpcd->OUT_ep[i];

        if (!ep->is_stall)
        {
          continue;
        }

        ep->is_stall = false;

        ret = USB_EPClearStall(hpcd->Instance, ep);
        if (ret != HAL_OK)
        {
          PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
          return;
        }

      }

      /* Reset device address to zero */
      ret = USB_SetDevAddress(hpcd->Instance, 0);
      if (ret != HAL_OK)
      {
        PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
        return;
      }

      break;

    case USB_DWC3_DEVICE_EVENT_CONNECT_DONE:
      PCD_DBGLOG1("Event: Device Connection Done\n");

      /*hpcd->Init.ep0_mps = MaxPacketSize to 512 (SuperSpeed), 64 (High-Speed), 8/16/32/64 (Full-Speed),/
       or 8 (Low-Speed).*/
      hpcd->Init.speed = USB_GetDevSpeed(hpcd->Instance);
      switch (hpcd->Init.speed)
      {
        case USB_DWC3_SPEED_SUPER:
          hpcd->Init.ep0_mps = PCD_SPEED_SUPER_MAXPACKETSIZE;
          break;
        case USB_DWC3_SPEED_HIGH:
          hpcd->Init.ep0_mps = PCD_SPEED_HIGH_MAXPACKETSIZE;
          break;
        case USB_DWC3_SPEED_FULL_48:
        case USB_DWC3_SPEED_FULL:
          hpcd->Init.ep0_mps = PCD_SPEED_FULL_MAXPACKETSIZE;
          break;
        case USB_DWC3_SPEED_LOW:
          hpcd->Init.ep0_mps = PCD_SPEED_LOW_MAXPACKETSIZE;
          break;
        default:
          PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
          break;
      }


      HAL_PCD_ResetCallback(hpcd);

      /* Update DWC3_GCTL_RAMCLKSEL, but only for Superspeed */

      /* Modify max packet size for EP 0 & 1 */
      ret = USB_ConfigureEP(hpcd->Instance, 0, false, EP_TYPE_CTRL, hpcd->Init.ep0_mps, 0, 0, 0,
                            hpcd->OUT_ep[0].intr_num, USB_DWC3_DEPCFG_ACTION_MODIFY);
      if (ret != HAL_OK)
      {
        PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
        return;
      }
      ret = USB_ConfigureEP(hpcd->Instance, 0, true, EP_TYPE_CTRL, hpcd->Init.ep0_mps, 0, 0, 1,
                            hpcd->IN_ep[0].intr_num, USB_DWC3_DEPCFG_ACTION_MODIFY);
      if (ret != HAL_OK)
      {
        PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
        return;
      }

      hpcd->OUT_ep[0].maxpacket = hpcd->Init.ep0_mps;
      hpcd->IN_ep[0].maxpacket = hpcd->Init.ep0_mps;

      /* Depending on the connected speed, write to the other PHY's control register to suspend it. */

      /* Use default values for GTXFIFOSIZn and GRXFIFOSIZ0 */
      break;

    case USB_DWC3_DEVICE_EVENT_LINK_STATUS_CHANGE:
      PCD_DBGLOG1("Event: Link Status Change : %s(%d)\n",
                  USB_GetLinkStateString(USB_ReadDeviceEventLinkState(event)),
                  USB_ReadDeviceEventLinkState(event));
      /* Handle link state changes, U0,U1,U2,U3 with suspend/resume functions */
      break;

    case USB_DWC3_DEVICE_EVENT_WAKEUP:
      PCD_DBGLOG1("Event: Wake-UP\n");
      /* resume function */
      HAL_PCD_ResumeCallback(hpcd);
      break;

