zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
    case USB_DWC3_DEVICE_EVENT_HIBER_REQ:
      PCD_DBGLOG1("Event: Hibernation Request\n");
      /* hibernation function */
      break;

    case USB_DWC3_DEVICE_EVENT_EOPF: /* End of Periodic Frame */
      PCD_DBGLOG1("Event: Suspend\n");
      HAL_PCD_SuspendCallback(hpcd);
      break;

    case USB_DWC3_DEVICE_EVENT_SOF: /* Start of Periodic Frame */
      PCD_DBGLOG1("Event: Start of Periodic Frame\n");
      break;

    case USB_DWC3_DEVICE_EVENT_L1SUSPEND:
      PCD_DBGLOG1("Event: L1 Suspend\n");
      HAL_PCD_SuspendCallback(hpcd);
      break;

    case USB_DWC3_DEVICE_EVENT_ERRATIC_ERROR: /* Erratic Error */
      PCD_DBGLOG1("Event: Erratic Error\n");
      break;

    case USB_DWC3_DEVICE_EVENT_CMD_CMPL: /* Command Complete */
      PCD_DBGLOG1("Event: Command Complete\n");
      break;

    case USB_DWC3_DEVICE_EVENT_OVERFLOW: /* Overflow */
      PCD_DBGLOG1("Event: Overflow\n");
      break;

    case USB_DWC3_DEVICE_EVENT_L1WAKEUP:
      PCD_DBGLOG("Event: L1 Wake-UP\n");
      /* resume function */
      HAL_PCD_ResumeCallback(hpcd);
      break;

    default:  /* UNKNOWN IRQ type */
      break;
  }
}
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PCD_Exported_Functions PCD Exported Functions
  * @{
  */

/** @defgroup PCD_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
            ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the PCD according to the specified
  *         parameters in the PCD_InitTypeDef and initialize the associated handle.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_Init(PCD_HandleTypeDef *hpcd)
{
  uint8_t i;
  HAL_StatusTypeDef ret;

  hpcd->Instance = (PCD_TypeDef *) PCD_MapIOAddr((uint32_t)hpcd->Instance, 0xCD00); /********/

  /* Check the PCD handle allocation */
  if (hpcd == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_PCD_ALL_INSTANCE(hpcd->Instance));

  /* Check hpcd->State is HAL_PCD_STATE_RESET, otherwise error */
  assert_param(hpcd->State == HAL_PCD_STATE_RESET);

  hpcd->State = HAL_PCD_STATE_BUSY;

  /* Init the low level hardware : GPIO, CLOCK, NVIC... */
  HAL_PCD_MspInit(hpcd);

  /* Disable the Interrupts */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    __HAL_PCD_DISABLE_INTR(hpcd, i);
  }

  /* Init the Core (common init.) */
  ret = USB_CoreInit(hpcd->Instance, hpcd->Init);
  if (ret != HAL_OK)
  {
    PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  /* Init endpoints structures */
  for (i = 0; i < USB_DWC3_NUM_IN_EP ; i++)
  {
    /* Init ep structure */
    hpcd->IN_ep[i].is_in = true;
    hpcd->IN_ep[i].num = i;
    hpcd->IN_ep[i].tx_fifo_num = i;
    /* Control until ep is activated */
    hpcd->IN_ep[i].type = EP_TYPE_CTRL;

    /*
     * We are doing 1:1 alternate mapping for endpoints, meaning
     * IN Endpoint X maps to Physical Endpoint 2*X +1 and
     * OUT Endpoint X maps to Physical Endpoint 2*X.
     * So USB endpoint 0x81 is 0x03.
     */
    hpcd->IN_ep[i].phy_epnum = __HAL_PCD_EPADDR_TO_PHYEPNUM(i | 0x80U);

  }

  for (i = 0; i < USB_DWC3_NUM_OUT_EP ; i++)
  {
    /* Init ep structure */
    hpcd->OUT_ep[i].is_in = false;
    hpcd->OUT_ep[i].num = i;
    hpcd->OUT_ep[i].tx_fifo_num = i;
    /* Control until ep is activated */
    hpcd->OUT_ep[i].type = EP_TYPE_CTRL;

    /*
     * We are doing 1:1 alternate mapping for endpoints, meaning
     * IN Endpoint X maps to Physical Endpoint 2*X +1 and
     * OUT Endpoint X maps to Physical Endpoint 2*X.
     * So USB endpoint 0x81 is 0x03.
     */
    hpcd->OUT_ep[i].phy_epnum = __HAL_PCD_EPADDR_TO_PHYEPNUM(i);

  }

  hpcd->Setup_dma_addr = (PCD_DmaAddrDef)PCD_GetDmaAddr((void *)hpcd->Setup, sizeof(hpcd->Setup), 1);
  if (hpcd->Setup_dma_addr == 0U)
  {
    return HAL_ERROR;
  }

  hpcd->Setup_addr = PCD_MapCoherentAddr((void *)hpcd->Setup, sizeof(hpcd->Setup));
  if (hpcd->Setup_addr == 0U)
  {
    return HAL_ERROR;
  }

  /* Map DMA and Coherent address for event buffers k = USB_DWC3_INT_INUSE */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    hpcd->IntBuffers.EvtBuffer_dma_addr[i] = PCD_GetDmaAddr((void *)hpcd->IntBuffers.EvtBuffer[i].EvtBufferArea,
                                                            sizeof(hpcd->IntBuffers.EvtBuffer[i].EvtBufferArea), 1);
    if (hpcd->IntBuffers.EvtBuffer_dma_addr[i] == 0U)
    {
      return HAL_ERROR;
    }

    hpcd->IntBuffers.EvtBuffer_addr[i] = PCD_MapCoherentAddr((void *)hpcd->IntBuffers.EvtBuffer[i].EvtBufferArea,
                                                             sizeof(hpcd->IntBuffers.EvtBuffer[i].EvtBufferArea));
    if (hpcd->IntBuffers.EvtBuffer_addr[i] == 0U)
    {
      return HAL_ERROR;
    }

    hpcd->IntBuffers.EvtBufferPos[i] = 0;

    PCD_DBGLOG3("EventBuffer%d: BuffArea=%08lx DmaAddr=%08lx CoherentMapAddr=%08lx\n", i,
                (uint32_t)hpcd->IntBuffers.EvtBuffer[i].EvtBufferArea, (uint32_t)hpcd->IntBuffers.EvtBuffer_dma_addr[i],
                (uint32_t)hpcd->IntBuffers.EvtBuffer_addr[i]);
  }

  /* MAP TRB Coherent and DMA address for EP0IN and EP0OUT */
  hpcd->IN_ep[0].trb_dma_addr = (uint32_t)PCD_GetDmaAddr((void *)&hpcd->IN_ep[0].trb, sizeof(hpcd->IN_ep[0].trb), 1);
  if (hpcd->IN_ep[0].trb_dma_addr == 0U)
  {
    return HAL_ERROR;
  }

  hpcd->IN_ep[0].trb_addr = (USB_DWC3_Trb *)PCD_MapCoherentAddr((void *)&hpcd->IN_ep[0].trb,
                                                                sizeof(hpcd->IN_ep[0].trb));
  if (hpcd->IN_ep[0].trb_addr == 0U)
  {
    return HAL_ERROR;
  }

  hpcd->OUT_ep[0].trb_dma_addr = (uint32_t)PCD_GetDmaAddr((void *)&hpcd->OUT_ep[0].trb, sizeof(hpcd->OUT_ep[0].trb), 1);
  if (hpcd->OUT_ep[0].trb_dma_addr == 0U)
  {
    return HAL_ERROR;
  }

  hpcd->OUT_ep[0].trb_addr = (USB_DWC3_Trb *)PCD_MapCoherentAddr((void *)&hpcd->OUT_ep[0].trb,
                                                                 sizeof(hpcd->OUT_ep[0].trb));
  if (hpcd->OUT_ep[0].trb_addr == 0U)
  {
    return HAL_ERROR;
  }

  if (PCD_IRQRegister(HAL_PCD_IRQHandler, hpcd) != HAL_OK)
  {
    return HAL_ERROR;
  }

