zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
  /* Init Device */
  hpcd->EP0_State = HAL_PCD_EP0_SETUP_QUEUED;
  ret = USB_DevInit(hpcd->Instance, hpcd->Init, hpcd->IntBuffers.EvtBuffer_dma_addr, &hpcd->OUT_ep[0],
                    hpcd->Setup_dma_addr, PCD_DEV_EVENTS_INTR);
  if (ret != HAL_OK)
  {
    PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  hpcd->State = HAL_PCD_STATE_READY;



  return HAL_OK;
}

/**
  * @brief  DeInitializes the PCD peripheral.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_DeInit(PCD_HandleTypeDef *hpcd)
{
  uint32_t i;
  HAL_StatusTypeDef ret;

  /* Check the PCD handle allocation */
  if (hpcd == NULL)
  {
    return HAL_ERROR;
  }

  /* Check hpcd->State is HAL_PCD_STATE_RESET, otherwise error */
  assert_param(hpcd->State == HAL_PCD_STATE_RESET);

  hpcd->State = HAL_PCD_STATE_BUSY;

  /* Stop Device */

  PCD_IRQUnRegister(hpcd);

  /* UnInit the Core (common init.) */
  ret = USB_CoreUnInit(hpcd->Instance);
  if (ret != HAL_OK)
  {
    PCD_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    PCD_UnMapCoherentAddr(hpcd->IntBuffers.EvtBuffer_addr[i]);

    PCD_PutDmaAddr(hpcd->IntBuffers.EvtBuffer_dma_addr[i], sizeof(hpcd->IntBuffers.EvtBuffer[i].EvtBufferArea), 1);
  }

  PCD_UnMapCoherentAddr(hpcd->Setup_addr);

  PCD_PutDmaAddr(hpcd->Setup_dma_addr, sizeof(hpcd->Setup), 1);

  /* DeInit the low level hardware */
  HAL_PCD_MspDeInit(hpcd);

  PCD_UnMapIOAddr(hpcd->Instance); /********/

  hpcd->State = HAL_PCD_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief  Initializes the PCD MSP.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes PCD MSP.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group2 Input and Output operation functions
  *  @brief   Data transfers functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the PCD data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Start The USB OTG Device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_Start(PCD_HandleTypeDef *hpcd)
{
  uint8_t i;

  /* Enable the USB Interrupts */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    __HAL_PCD_ENABLE_INTR(hpcd, i);
  }

  /* Enable Pullups */
  return USB_DevConnect(hpcd->Instance);
}

/**
  * @brief  Stop The USB OTG Device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_Stop(PCD_HandleTypeDef *hpcd)
{
  uint8_t i;

  /* FIFOs are flushed inside Stop Transfer command */
  /* Stop transfers for all(USB_DWC3_NUM_IN_EPS) EP except EP0IN k = USB_DWC3_NUM_IN_EP */
  for (i = 0; i < USB_DWC3_NUM_IN_EP; i++)
  {
    if (USB_EPStopXfer(hpcd->Instance, &hpcd->IN_ep[i]) == HAL_OK)
    {
      HAL_PCD_DataInStageCallback(hpcd, i);
    }
  }

  /* Stop transfers for all EP except EP0OUT k = USB_DWC3_NUM_OUT_EP */
  for (i = 0; i < USB_DWC3_NUM_OUT_EP; i++)
  {
    if (USB_EPStopXfer(hpcd->Instance, &hpcd->OUT_ep[i]) == HAL_OK)
    {
      HAL_PCD_DataOutStageCallback(hpcd, i);
    }
  }

  /* Disable the USB Interrupts */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    __HAL_PCD_DISABLE_INTR(hpcd, i);
  }

  /* Disable Pullups */
  return USB_DevDisconnect(hpcd->Instance);
}

/**
  * @brief  Handle PCD interrupt request.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
void HAL_PCD_IRQHandler(PCD_HandleTypeDef *hpcd)
{
  uint32_t evtcnt;
  uint32_t evt;
  uint8_t i;

  /* Use same handler for all the Evt-Buf IRQs */

  /* Check for all Event Buffer interrupt k = USB_DWC3_INT_INUSE */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    evtcnt = USB_ReadInterruptCount(hpcd->Instance, i);

    for (evt = 0; evt < evtcnt; evt += USB_DWC3_EVENT_SIZE)
    {
      if (USB_IsEndpointEvent(__HAL_PCD_READ_EVENT(hpcd, i)))   /* EP event */
      {
        PCD_Handle_EP_Event(hpcd, __HAL_PCD_READ_EVENT(hpcd, i));
      }
      else      /* NON-EP event */
      {
        if (USB_IsDeviceEvent(__HAL_PCD_READ_EVENT(hpcd, i)))   /* Device specific event */
        {
          PCD_Handle_DEV_Event(hpcd, __HAL_PCD_READ_EVENT(hpcd, i));
        }
        else
        {
          /* Error, non supported events */
        }
      }

      __HAL_PCD_INCR_EVENT_POS(hpcd, i, USB_DWC3_EVENT_SIZE);

      USB_AckEventCount(hpcd->Instance, i, USB_DWC3_EVENT_SIZE);
    }
  }
}

/**
  * @brief  Data OUT stage callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_DataOutStageCallback could be implemented in the user file
   */
}

/**
  * @brief  Data IN stage callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_DataInStageCallback could be implemented in the user file
   */
}
/**
  * @brief  Setup stage callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_SetupStageCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Start Of Frame callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_SOFCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Reset callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ResetCallback could be implemented in the user file
   */
}

/**
  * @brief  Suspend event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_SuspendCallback could be implemented in the user file
   */
}

/**
  * @brief  Resume event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ResumeCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO OUT callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO IN  callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ISOINIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Connection event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ConnectCallback could be implemented in the user file
   */
}

/**
  * @brief  Disconnection event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_DisconnectCallback could be implemented in the user file
   */
}

/**
  * @}
  */

