zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
/** @defgroup PCD_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   management functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the PCD data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Set the USB Device address.
  * @param  hpcd PCD handle
  * @param  address new device address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_SetAddress(PCD_HandleTypeDef *hpcd, uint8_t address)
{
  return USB_SetDevAddress(hpcd->Instance, address);
}

/**
  * @brief  Set the USB Device address.
  * @param  hpcd PCD handle
  * @param  test_mode USB Device Test Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_SetTestMode(PCD_HandleTypeDef *hpcd, uint8_t test_mode)
{
  return USB_SetTestMode(hpcd->Instance, test_mode);
}

/**
  * @brief  Open and configure an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  ep_mps endpoint max packet size
  * @param  ep_type endpoint type
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Open(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint16_t ep_mps, uint8_t ep_type)
{
  USB_DWC3_EPTypeDef *ep;

  if ((ep_addr & 0x80U) == 0x80U)
  {
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_addr & 0x7FU];
  }

  ep->num = ep_addr & 0x7FU;

  if (ep->num == 0U) /*Do not let the USB-MW control EP0 & EP1*/
  {
    return HAL_ERROR;
  }

  ep->is_in = ((ep_addr & 0x80U) == 0x80U);
  ep->maxpacket = ep_mps;
  ep->type = ep_type;

  ep->trb_dma_addr = (uint32_t)PCD_GetDmaAddr((void *)ep->trb, sizeof(ep->trb), 1);
  if (ep->trb_dma_addr == 0U)
  {
    return HAL_ERROR;
  }

  ep->trb_addr = (USB_DWC3_Trb *)PCD_MapCoherentAddr((void *)ep->trb, sizeof(ep->trb));
  if (ep->trb_addr == 0U)
  {
    return HAL_ERROR;
  }

  /* Set to 0, to ignore for FS (bInterval_m1 should be 0) and also non-periodic EP */
  ep->bInterval = 0;

  if (USB_IsEndpointEnabled(hpcd->Instance, ep->phy_epnum))
  {
    return HAL_ERROR;
  }

  return USB_ActivateEndpoint(hpcd->Instance, ep);
}

/**
  * @brief  Open and configure an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  ep_mps endpoint max packet size
  * @param  ep_type endpoint type
  * @param  ep_bInterval  endpoint open interval
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Open_Periodic(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint16_t ep_mps, uint8_t ep_type,
                                           uint8_t ep_bInterval)
{
  USB_DWC3_EPTypeDef *ep;
  HAL_StatusTypeDef ret;

  if ((ep_addr & 0x80U) == 0x80U)
  {
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_addr & 0x7FU];
  }

  ep->num = ep_addr & 0x7FU;

  if (ep->num == 0U) /*Do not let the USB-MW control EP0 & EP1*/
  {
    return HAL_ERROR;
  }

  ep->is_in = ((ep_addr & 0x80U) == 0x80U);
  ep->maxpacket = ep_mps;
  ep->type = ep_type;

  ep->trb_dma_addr = (uint32_t)PCD_GetDmaAddr((void *)ep->trb, sizeof(ep->trb), 1);
  if (ep->trb_dma_addr == 0U)
  {
    return HAL_ERROR;
  }

  ep->trb_addr = (USB_DWC3_Trb *)PCD_MapCoherentAddr((void *)ep->trb, sizeof(ep->trb));
  if (ep->trb_addr == 0)
  {
    return HAL_ERROR;
  }

  ep->bInterval = ep_bInterval;

  if (USB_IsEndpointEnabled(hpcd->Instance, ep->phy_epnum))
  {
    return HAL_ERROR;
  }

  ret = USB_ActivateEndpoint(hpcd->Instance, ep);

  return ret;
}

/**
  * @brief  Deactivate an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Close(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
  USB_DWC3_EPTypeDef *ep;
  HAL_StatusTypeDef ret;
  bool stopped = false;

  if ((ep_addr & 0x80U) == 0x80U)
  {
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_addr & 0x7FU];
  }

  if (!USB_IsEndpointEnabled(hpcd->Instance, ep->phy_epnum))
  {
    return HAL_ERROR;
  }

  /* Stop Transfer on this EP */
  if (USB_EPStopXfer(hpcd->Instance, ep) == HAL_OK)
  {
    stopped = true;
  }

  ret = USB_DeactivateEndpoint(hpcd->Instance, ep);

  if (stopped)
  {
    if (ep->is_in)
    {
      HAL_PCD_DataInStageCallback(hpcd, ep_addr);
    }
    else
    {
      HAL_PCD_DataOutStageCallback(hpcd, ep_addr);
    }
  }

  PCD_UnMapCoherentAddr(ep->trb_addr);

  PCD_PutDmaAddr(ep->trb_dma_addr, sizeof(ep->trb), 1);

  return ret;
}

/**
  * @brief  Receive an amount of data.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  pBuf pointer to the reception buffer
  * @param  len amount of data to be received
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Receive(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
  USB_DWC3_EPTypeDef *ep;

  ep = &hpcd->OUT_ep[ep_addr & 0x7FU];

  if (!USB_IsEndpointEnabled(hpcd->Instance, ep->phy_epnum))
  {
    return HAL_ERROR;
  }

  if ((len > ep->maxpacket) && !IS_MULTIPLE(len, ep->maxpacket))
  {
    PCD_DBGLOG("WARNING:PacketSize>Max_packet but non-multiple,buffer should be of at least Max_packetsize multiple\n");
  }

  /*setup and start the Xfer */
  if ((len != 0U) && (len < ep->maxpacket))
  {
    ep->xfer_buff = ep->bounce_buf;
    ep->xfer_len = ep->maxpacket;
    ep->xfer_dest_buff = pBuf;
    ep->xfer_dest_len = len;
  }
  else
  {
    ep->xfer_buff = pBuf;
    ep->xfer_len = ALIGN_MULTIPLE(len, ep->maxpacket);
  }

  ep->xfer_count = 0;
  ep->is_in = false;
  ep->num = ep_addr & 0x7FU;

  ep->dma_addr = ((ep->xfer_buff != 0) ? PCD_MapDmaAddr(ep->xfer_buff, ep->xfer_len, 0) : 0x0U);

  if ((ep_addr & 0x7FU) == 0U)
  {
    /* For Status ZLP packet */
    if (len == 0U)
    {
      /* 2-stage/3-stage control transfer */
      if (__HAL_PCD_SETUP_REQ_LEN(hpcd->Setup_addr) == 0U)
      {
        ep->trb_flag = USB_DWC3_TRBCTL_CONTROL_STATUS2;
      }
      else
      {
        ep->trb_flag = USB_DWC3_TRBCTL_CONTROL_STATUS3;
      }
    }
    else
    {
      ep->trb_flag = USB_DWC3_TRBCTL_CONTROL_DATA;
    }
  }
  else
  {
    if ((ep->type == EP_TYPE_INTR) || (ep->type == EP_TYPE_BULK))
    {
      ep->trb_flag = USB_DWC3_TRBCTL_NORMAL;
    }
    else
    {
      ep->trb_flag = USB_DWC3_TRBCTL_ISOCHRONOUS_FIRST;
    }
  }

  return USB_EPStartXfer(hpcd->Instance, ep);
}

/**
  * @brief  Get Received Data Size.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval Data Size
  */
uint16_t HAL_PCD_EP_GetRxCount(const PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
  return (uint16_t)hpcd->OUT_ep[ep_addr & 0xFU].xfer_count;
}

/**
  * @brief  Send an amount of data.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  pBuf pointer to the transmission buffer
  * @param  len amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Transmit(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
  USB_DWC3_EPTypeDef *ep;

  ep = &hpcd->IN_ep[ep_addr & 0x7FU];

  if (!USB_IsEndpointEnabled(hpcd->Instance, ep->phy_epnum))
  {
    return HAL_ERROR;
  }

