zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pcd_drd.c
  /*setup and start the Xfer */
  ep->xfer_buff = pBuf;
  ep->xfer_len = len;
  ep->xfer_count = 0;
  ep->is_in = true;
  ep->num = ep_addr & 0x7FU;

  ep->dma_addr = ((ep->xfer_buff != 0) ? PCD_MapDmaAddr(ep->xfer_buff, ep->xfer_len, 1) : 0x0U);

  if ((ep_addr & 0x7FU) == 0U)
  {
    /* For Status ZLP packet */
    if (len == 0U)
    {
      /* 2-stage/3-stage control transfer */
      if (__HAL_PCD_SETUP_REQ_LEN(hpcd->Setup_addr) == 0U)
      {
        ep->trb_flag = USB_DWC3_TRBCTL_CONTROL_STATUS2;
      }
      else
      {
        ep->trb_flag = USB_DWC3_TRBCTL_CONTROL_STATUS3;
      }
    }
    else
    {
      ep->trb_flag = USB_DWC3_TRBCTL_CONTROL_DATA;
    }
  }
  else
  {
    if ((ep->type == EP_TYPE_INTR) || (ep->type == EP_TYPE_BULK))
    {
      ep->trb_flag = USB_DWC3_TRBCTL_NORMAL;
    }
    else
    {
      ep->trb_flag = USB_DWC3_TRBCTL_ISOCHRONOUS_FIRST;
    }
  }

  return USB_EPStartXfer(hpcd->Instance, ep);
}

/**
  * @brief  Set a STALL condition over an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_SetStall(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
  USB_DWC3_EPTypeDef *ep;
  HAL_StatusTypeDef ret;

  if ((0x80U & ep_addr) == 0x80U)
  {
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_addr];
  }

  /* For control endpoints, the application issues only the Set Stall command, and only on the
  OUT direction of the control endpoint. The controller automatically clears the STALL when it
  receives a SETUP token for the endpoint. The application must not issue the Clear Stall command
  on a control endpoint*/
  if (ep_addr == 0x80U)
  {
    return HAL_OK;
  }

  if (ep->is_stall)
  {
    return HAL_OK;
  }

  ep->is_stall = true;
  ep->num   = ep_addr & 0x7FU;
  ep->is_in = ((ep_addr & 0x80U) == 0x80U);

  ret = USB_EPSetStall(hpcd->Instance, ep);
  if (ret != HAL_OK)
  {
    return ret;
  }

  if ((ep_addr & 0x7FU) == 0U)
  {
    hpcd->EP0_State = HAL_PCD_EP0_SETUP_QUEUED;
    ret = USB_EP0_OutStart(hpcd->Instance, &hpcd->OUT_ep[0], hpcd->Setup_dma_addr);
  }

  return ret;
}

/**
  * @brief  Clear a STALL condition over in an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_ClrStall(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
  USB_DWC3_EPTypeDef *ep;

  if ((0x80U & ep_addr) == 0x80U)
  {
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_addr];
  }

  if (!(ep->is_stall))
  {
    return HAL_OK;
  }

  ep->is_stall = false;
  ep->num   = ep_addr & 0x7FU;
  ep->is_in = ((ep_addr & 0x80U) == 0x80U);

  return USB_EPClearStall(hpcd->Instance, ep);
}

/**
  * @brief  Flush an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Flush(const PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
  /* To be Replaced by dummy function, since dma (descriptor) use is non-avoidable.
  There is no method to flush TxFifo/RxFifo */

  UNUSED(hpcd);
  UNUSED(ep_addr);
  return HAL_OK;
}

/**
  * @brief  Activate remote wakeup signalling.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_ActivateRemoteWakeup(PCD_HandleTypeDef *hpcd)
{
  return USB_ActivateRemoteWakeup(hpcd->Instance);
}

/**
  * @brief  De-activate remote wakeup signalling.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_DeActivateRemoteWakeup(PCD_HandleTypeDef *hpcd)
{
  /* Nothing to be done since HAL_PCD_ActivateRemoteWakeup handles both activation and deactivation */

  return HAL_PCD_ActivateRemoteWakeup(hpcd);
}

/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral State functions #####
 ===============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the PCD handle state.
  * @param  hpcd PCD handle
  * @retval HAL state
  */
PCD_StateTypeDef HAL_PCD_GetState(const PCD_HandleTypeDef *hpcd)
{
  return hpcd->State;
}

/**
  * @}
  */

/**
  * @}
  */
#endif /* HAL_PCD_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

